Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: སངས་རྒྱས་ཀྱི་ཞིང་གང་དང་གང་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་བཞུགས་ཤིང་འཚོ་སྐྱོང་བ་དེ་དང་དེ་དག་ཏུ་ཡང་སྐྱེ་བར་འགྱུར་ཏེ། དེ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་ལ་ཡང་བསྙེན་བཀུར་བྱེད་པར་འགྱུར་རོ།
en: They will be reborn in whichever buddhafields the tathāgatas, arhats, completely awakened buddhas are alive, and they will again venerate the tathāgatas, arhats, completely awakened buddhas. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དགའ་ལྡན་གྱི་ལྷའི་རིས་ནས་ཤི་འཕོས་ནས་འདིར་སྐྱེས་པ་དེ་ནི་ཚེ་གཅིག་གིས་ཐོགས་པ་སྟེ།
en: In this regard, Śāradvatīputra, those bodhisattva great beings who have died and transmigrated from the god realm of Tuṣita, so as to be reborn here, will be destined for only one more rebirth.

source: དེ་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་ཉམས་པ་མེད་པའོ།
en: They will be undiminished in their understanding of the six perfections.

source: །གཟུངས་ཀྱི་སྒོ་དང་ཏིང་ངེ་འཛིན་གྱི་སྒོ་ཐམས་ཅད་ཀྱང་དེར་མ་འདུས་པ་མེད་དོ།
en: There are indeed no dhāraṇī gateways and no gateways of meditative stability that they will not master. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་མིའི་ནང་ནས་ཤི་འཕོས་ནས། མི་དང་སྐལ་བ་མཉམ་པ་ཉིད་དུ་སྐྱེས་པ་དེ་ནི། ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མ་གཏོགས་པར་དབང་པོ་རྟུལ་བ་ཡིན་ཏེ།
en: Śāradvatīputra, those bodhisattva great beings who, having died and transmigrated from the human realm, are reborn with the same fortune as humans, unless they are irreversible bodhisattvas, will have dull faculties.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣལ་འབྱོར་ལ་ཡང་མྱུར་དུ་མཉམ་པར་གཞོག་པ་མ་ཡིན་ནོ།
en: They will not become swiftly absorbed in union with the perfection of wisdom.

source: །དེ་ལ་གཟུངས་ཀྱི་སྒོ་དང་། ཏིང་ངེ་འཛིན་གྱི་སྒོ་རྣམས་ཀྱང་མྱུར་དུ་མངོན་དུ་མི་འགྱུར་རོ།
en: Nor indeed will they swiftly actualize the dhāraṇī gateways or the gateways of meditative stability. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་གང་ཁྱོད་ཀྱིས་དེ་སྐད་དུ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་རྣལ་འབྱོར་འདི་ལ་སྙོམས་པར་འཇུག་པ་དེ། འདི་ནས་ཤི་འཕོས་ནས་གང་དུ་སྐྱེ་བར་འགྱུར་ཞེས་སྨྲས་པ་ནི།
en: Śāradvatīputra, you asked where those bodhisattva great beings who are absorbed in union with the perfection of wisdom will be reborn when they have died and transmigrated from here.

source: ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་ཤི་འཕོས་ནས། གང་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་བཞུགས་ཤིང་འཚོ་སྐྱོང་བའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ནས་དེར་འགྲོ་སྟེ།
en: Śāradvatīputra, when those bodhisattva great beings have died and transmigrated from this buddhafield, {Dt.61} they will go to those buddhafields where the lord buddhas are alive.

source: ནམ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་སངས་རྒྱས་ཀྱི་བར་དུ། ནམ་ཡང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་འབྲལ་བར་མི་འགྱུར་རོ།། །།
en: They will never be separated from the lord buddhas until they themselves have attained manifest buddhahood in unsurpassed, complete enlightenment. “

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ། བམ་པོ་ལྔ་པ། ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐབས་ལ་མི་མཁས་པ་དག་བསམ་གཏན་བཞི་པོ་ལ་མཉམ་པར་གཞོག་ཅིང་། ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་ཡང་སྤྱོད་དེ།
en: Śāradvatīputra, there are bodhisattva great beings without skillful means who are absorbed in the four meditative concentrations and who also practice the six perfections.

source: དེ་དག་བསམ་གཏན་ཐོབ་པས་ལྷ་ཚེ་རིངས་པོའི་ནང་དུ་སྐྱེས་ཤིང་། གལ་ཏེ་མིའི་ནང་དུ་སྐྱེ་བ་ཐོབ་ནས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལ་བསྙེན་བཀུར་བྱེད་ན་ཡང་། དེ་དག་དབང་པོ་རྟུལ་ཞིང་དབང་པོ་མི་རྣོ་བ་ཡང་ཡོད་དོ། །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་ལ་ཡང་མཉམ་པར་གཞོག་ལ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཡང་སྤྱོད་དེ།
en: Since they have attained the meditative concentrations, they will be reborn among the long-living gods, and, if they do obtain a rebirth among human beings, even though they might venerate the lord buddhas, {Dt.62} they will still have dull and blunted faculties. “

source: དེ་དག་ཐབས་ལ་མི་མཁས་པས་བསམ་གཏན་རྣམས་སྤངས་ནས་ཕྱིར་འདོད་པའི་ཁམས་སུ་སྐྱེ་བ་ཡང་ཡོད་དེ། ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ཀྱང་དབང་པོ་རྟུལ་བ་ཡིན་ཏེ། དབང་པོ་རྣོ་བ་མ་ཡིན་ནོ། །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་དང་པོ་ནས། བཞི་པ་ལ་ཡང་སྙོམས་པར་འཇུག །བྱམས་པ་ལ་ཡང་སྙོམས་པར་འཇུག་སྙིང་རྗེ་དང་དགའ་བ་དང་བཏང་སྙོམས་ལ་ཡང་སྙོམས་པར་འཇུག །ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལ་ཡང་སྙོམས་པར་འཇུག །རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་དང་། ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་དང་། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ལ་ཡང་སྙོམས་པར་འཇུག །དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་ལ་ཡང་སྙོམས་པར་འཇུག །ཡང་དག་པར་སྤོང་བ་བཞི་དང་།
en: Moreover, Śāradvatīputra, there are bodhisattva great beings who are also absorbed in the four meditative concentrations and who also practice the six perfections, but since they are without skillful means, after abandoning their meditative concentrations they too will be reborn in the realm of desire.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་།
en: Śāradvatīputra, they too will have dull and blunted faculties. “

source: དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་ཡང་སྙོམས་པར་འཇུག །སྙིང་རྗེ་ཆེན་པོ་ལ་ཡང་སྙོམས་པར་འཇུག་སྟེ།
en: Śāradvatīputra, there are also bodhisattva great beings who are absorbed in [the meditative concentrations], from the first meditative concentration to the fourth; who are absorbed in loving kindness, and who are absorbed in compassion, empathetic joy, and equanimity; who are absorbed in the sphere of infinite space, and who are absorbed in the sphere of infinite consciousness, the sphere of nothing-at-all, and the sphere of neither perception nor nonperception; who are absorbed in the four applications of mindfulness, and who are absorbed in the four correct exertions, the four supports for miraculous ability, the five faculties, the five powers, the seven branches of enlightenment, and the noble eightfold path; and who are absorbed in great compassion.

source: སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་དེ་དག་ཐབས་མཁས་པས། བསམ་གཏན་གྱི་དབང་གིས་མི་སྐྱེ། ཚངས་པའི་རྣམ་པར་སྤྱོད་པའི་དབང་གིས་མི་སྐྱེ། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པའི་དབང་གིས་མི་སྐྱེ་སྟེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་གང་ན་བཞུགས་ཤིང་འཚོ་སྐྱོང་བ་དེ་དང་དེ་དག་ཏུ་སྐྱེ་བར་འགྱུར་བ་ཡོད་དོ།
en: Endowed as they are with great compassion, owing to their skillful means, their rebirth will not be influenced by their meditative concentrations, their rebirth will not be influenced by their pure abidings, and their rebirth will not be influenced by their formless absorptions, but they will be reborn wherever the lord buddhas are alive at present.

source: །དེ་དག་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་རྣལ་འབྱོར་དང་ཡང་མ་བྲལ་བས། བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་འཚང་རྒྱའོ།
en: Since they do not part from the practice of the perfection of wisdom, they will attain manifest buddhahood in unsurpassed, complete enlightenment in this very Auspicious Eon. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་བཞི་པོ་ལ་ཡང་སྙོམས་པར་འཇུག །བྱམས་པ་དང་། སྙིང་རྗེ་དང་། དགའ་བ་དང་། བཏང་སྙོམས་ལ་ཡང་སྙོམས་པར་འཇུག །ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་དང་། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་དང་། ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་དང་། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ལ་ཡང་སྙོམས་པར་འཇུག་ཅིང་དེ་དག་ཐབས་མཁས་པས། བསམ་གཏན་དང་། ཏིང་ངེ་འཛིན་དང་།
en: Śāradvatīputra, there are also bodhisattva great beings who are absorbed in the four meditative concentrations, who are absorbed in loving kindness, compassion, empathetic joy, and equanimity, who are absorbed in the sphere of infinite space, the sphere of infinite consciousness, the sphere of nothing-at-all, and the sphere of neither perception nor nonperception, and who, owing to their skillful means, will not be reborn due to their meditative concentrations, meditative stabilities, or meditative absorptions.

source: སྙོམས་པར་འཇུག་པའི་དབང་གིས་མི་སྐྱེ་བ་ཡང་ཡོད་དེ། དེ་དག་ནི་ཕྱིར་འདོད་པའི་ཁམས་འདིར་སྐྱེས་ཀྱང་། རྒྱལ་རིགས་ཆེ་ཞིང་མཐོ་བའམ། བྲམ་ཟེའི་རིགས་ཆེ་ཞིང་མཐོ་བ་འམ། ཁྱིམ་བདག་གི་རིགས་ཆེ་ཞིང་མཐོ་བའི་རིགས་སུ་སྐྱེ་སྟེ། དེ་ཡང་སྲིད་པ་ལ་བརྐམ་པའི་ཕྱིར་མ་ཡིན་གྱི། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་རོ།
en: Even though they might be reborn in this realm of desire, they will be born into great and lofty royal families, great and lofty priestly families, or great and lofty householder families, not out of yearning for the rebirth process but in order to bring beings to maturation. “

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་བཞི་པོ་ལ་ཡང་སྙོམས་པར་འཇུག །བྱམས་པ་དང་སྙིང་རྗེ་དང་དགའ་བ་དང་བཏང་སྙོམས་ལ་ཡང་སྙོམས་པར་འཇུག །ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལ་ཡང་སྙོམས་པར་འཇུག །རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་དང་། ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་དང་། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ལ་ཡང་སྙོམས་པར་འཇུག་ཅིང་། དེ་དག་ཐབས་མཁས་པས་བསམ་གཏན་དང་ཏིང་ངེ་འཛིན་དང་།
en: Śāradvatīputra, there are also bodhisattva great beings who are absorbed in the four meditative concentrations, who are absorbed in loving kindness, compassion, empathetic joy, and equanimity, who are absorbed in the sphere of infinite space, who are absorbed in the sphere of infinite consciousness, the sphere of nothing-at-all, and the sphere of neither perception nor nonperception, and who, owing to their skillful means, will not be reborn due to their meditative concentrations, meditative stabilities, or meditative absorptions.

source: སྙོམས་པར་འཇུག་པའི་དབང་གིས་མི་སྐྱེ་བ་ཡང་ཡོད་དེ། དེ་དག་ནི་རྒྱལ་པོ་ཆེན་པོ་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་དང་། སྐལ་བ་མཉམ་པར་བྱའོ། །སུམ་ཅུ་རྩ་གསུམ་དང་།
en: They will be reborn equal in fortune to the gods of Caturmahā­rāja­kāyika.

source: མཚེ་མ་དང་། དགའ་ལྡན་དང་། འཕྲུལ་དགའ་དང་། གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷ་རྣམས་དང་། སྐལ་བ་མཉམ་པར་སྐྱེས་ཏེ།
en: They will be reborn equal in fortune to the gods of Trayastriṃśa, Yāma, Tuṣita, Nirmāṇarata, and Para­nirmita­vaśa­vartin.

source: དེ་དག་ན་གནས་ཤིང་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་དོ།
en: Dwelling in these realms, they will bring beings to maturation.

source: །སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱེད་དོ། །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱང་མཉེས་པར་བྱེད་དོ།
en: They will refine the buddhafields, and they will also please the lord buddhas. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དག་ཐབས་མཁས་པས། བསམ་གཏན་བཞི་པོ་ལ་ཡང་སྙོམས་པར་འཇུག །བྱམས་པ་དང་སྙིང་རྗེ་དང་དགའ་བ་དང་བཏང་སྙོམས་ལ་ཡང་སྙོམས་པར་འཇུག །ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལ་ཡང་སྙོམས་པར་འཇུག །རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་དང་།
en: Śāradvatīputra, there are also bodhisattva great beings who practice the perfection of wisdom, and who, owing to their skillful means, are absorbed in the four meditative concentrations, who are absorbed in loving kindness, compassion, empathetic joy, and equanimity, who are absorbed in the sphere of infinite space, and who are absorbed in the sphere of infinite consciousness, the sphere of nothing-at-all, and the sphere of neither perception nor nonperception.

source: ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་དང་། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ལ་ཡང་སྙོམས་པར་འཇུག་པ་ཡོད་དེ། དེ་དག་ནི་འདི་ནས་ཤི་འཕོས་ནས་ཚངས་པའི་འཇིག་རྟེན་དུ་སྐྱེའོ།
en: After passing away from here and transmigrating, they will be reborn in the worlds of Brahmā.

source: །དེ་དག་དེ་ན་ཡང་ཚངས་པ་ཚངས་ཆེན་དབང་ཆེན་པོ་དང་ལྡན་པ་བརྒྱ་ཕྲག་བཅུ་ལ་དབང་སྒྱུར་བ་དེ་ལྟ་བུའི་སེམས་ཅན་གྱི་ནང་ན་ཡང་མཆོག་དམ་པ་ཕུལ་དུ་བྱ་བར་འགྱུར་ཏེ།
en: There, they will become the best, supreme, and most excellent of beings, holding sway over one hundred and ten most powerful gods of the Brahmā and Mahābrahmā realms.

source: དེ་དག་དེ་ན་འཁོད་ཅིང་གང་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་མངོན་པར་སངས་རྒྱས་ཤིང་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་བཞུགས་པ་དེ་ལྟ་བུའི་སངས་རྒྱས་ཀྱི་ཞིང་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དུ་རྒྱུ་ཞིང་དོང་ངོ་།
en: Residing in these realms, they will move from buddhafield to buddhafield, staying wherever the tathāgatas, arhats, completely awakened buddhas attain manifest buddhahood and turn the wheel of the Dharma.

source: །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་ལ་ཡང་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བའི་དོན་དུ་གསོལ་བ་གདབ་པ་བྱེད་དོ། །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚེ་གཅིག་གིས་ཐོགས་པ།
en: They will also request those tathāgatas, arhats, completely awakened buddhas to turn the wheel of the Dharma. “

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དག་ཐབས་མཁས་པས། བསམ་གཏན་བཞི་པོ་ལ་ཡང་སྙོམས་པར་འཇུག །བྱམས་པ་དང་སྙིང་རྗེ་དང་དགའ་བ་དང་བཏང་སྙོམས་ལ་ཡང་སྙོམས་པར་འཇུག །ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལ་ཡང་སྙོམས་པར་འཇུག །རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་དང་། ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་དང་། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ལ་ཡང་སྙོམས་པར་འཇུག །དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་དང་། ཡང་དག་པར་སྤོང་བ་བཞི་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་ཡང་བསྒོམ། སྟོང་པ་ཉིད་དང་།
en: Śāradvatīputra, there are bodhisattva great beings, destined for only one more rebirth, who practice the perfection of wisdom, and who, owing to their skillful means, are absorbed in the four meditative concentrations, are absorbed in loving kindness, compassion, empathetic joy, and equanimity, are absorbed in the sphere of infinite space, are absorbed in the sphere of infinite consciousness, the sphere of nothing-at-all, and the sphere of neither perception nor nonperception, who cultivate the four applications of mindfulness, the four correct exertions, the four supports for miraculous ability, the five faculties, the five powers, the seven branches of enlightenment, and the noble eightfold path, and who are absorbed in the meditative stabilities of emptiness, signlessness and wishlessness. {

source: མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་ལ་ཡང་སྙོམས་པར་འཇུག་ཅིང་།
en: Dt.63} However, they will not be reborn due to those attributes.

source: དེ་དག་གི་དབང་གིས་མི་སྐྱེ་བ་ཡང་ཡོད་དེ། དེ་དག་སངས་རྒྱས་བཅོམ་ལྡན་འདས་མངོན་དུ་གྱུར་པ་རྣམས་བསྙེན་བཀུར་ཅིང་། དེ་དག་ཏུ་ཚངས་པའི་སྤྱོད་པ་སྤྱད་དེ། དགའ་ལྡན་གྱི་ལྷ་དང་སྐལ་བ་མཉམ་པར་སྐྱེ་སྟེ།
en: Rather, they will venerate the lord buddhas who are actually present and, after practicing chaste conduct, they will be reborn equal in fortune to the gods of Tuṣita.

source: དེ་དག་དེར་ཚེའི་ཚུལ་བཞིན་དུ་གནས་ནས། དབང་པོ་མ་ཉམས་པ་དང་དྲན་ཞིང་ཤེས་བཞིན་དུ་ལྷ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མས་བསྐོར་ཏེ་མདུན་དུ་བྱས་ནས་འདིར་སྐྱེ་བ་བསྟན་སྟེ།
en: Remaining there for a lifetime, as it were, they manifest and are demonstrably born there, with undiminished sense faculties, recollection, and alertness, surrounded by many hundred billion trillion gods.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་སངས་རྒྱས་ནས་སངས་རྒྱས་ཀྱི་ཞིང་སྣ་ཚོགས་དག་ཏུ་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་དག་ཀྱང་ཡོད་དོ།
en: They will attain perfect buddhahood in unsurpassed, complete enlightenment, and indeed turn the wheels of the Dharma in various buddhafields. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མངོན་པར་ཤེས་པ་དྲུག་ཐོབ་པ་དག་འདོད་པའི་ཁམས་སུ་ཡང་མི་སྐྱེ། གཟུགས་ཀྱི་ཁམས་དང་གཟུགས་མེད་པའི་ཁམས་སུ་ཡང་མི་སྐྱེ་བར།
en: Śāradvatīputra, there are bodhisattva great beings who have attained the six extrasensory powers, who will neither be reborn in the realm of desire, nor will they be reborn in the realm of form or the realm of formlessness.

source: དེ་དག་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ལ་རིམ་གྲོ་དང་བཀུར་སྟི་དང་བསྟི་སྟང་དང་མཆོད་པ་བྱེད་ཅིང་སངས་རྒྱས་ཀྱི་ཞིང་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དུ་འདོང་བ་དག་ཀྱང་ཡོད་དོ།
en: They will serve, venerate, honor, and worship the tathāgatas, arhats, completely awakened buddhas, and also proceed from buddhafield to buddhafield. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མངོན་པར་ཤེས་པ་དྲུག་ཐོབ་པ་དག །མངོན་པར་ཤེས་པ་དྲུག་པོ་དེ་དག་གིས་རྣམ་པར་རྩེ་ཞིང་སངས་རྒྱས་ཀྱི་ཞིང་གང་ན། ཐེག་པ་ཆེན་པོ་མ་གཏོགས་པར་ཉན་ཐོས་ཀྱི་ཐེག་པ་དང་རང་སངས་རྒྱས་ཀྱི་ཐེག་པའི་སྒྲ་ཡང་མི་གྲག་པ་དེ་ལྟ་བུའི་སངས་རྒྱས་ཀྱི་ཞིང་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དུ་འདོང་བ་དག་ཀྱང་ཡོད་དོ།
en: Śāradvatīputra, there are bodhisattva great beings who have attained the six extrasensory powers, and who, emanating by means of those six extrasensory powers, proceed from buddhafield to buddhafield, wherever, apart from the Great Vehicle, even the names of the vehicle of śrāvakas and the vehicle of pratyekabuddhas do not resonate. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མངོན་པར་ཤེས་པ་དྲུག་ཐོབ་པ་དག །མངོན་པར་ཤེས་པ་དེ་དག་གིས་རྣམ་པར་རྩེ་ཞིང་སངས་རྒྱས་ཀྱི་ཞིང་གང་ན། སེམས་ཅན་རྣམས་ཀྱི་ཚེ་དཔག་ཏུ་མེད་པ་དེ་ལྟ་བུའི་སངས་རྒྱས་ཀྱི་ཞིང་ནས། སངས་རྒྱས་ཀྱི་ཞིང་དུ་འདོང་བ་དག་ཀྱང་ཡོད་དོ།
en: Śāradvatīputra, there are also bodhisattva great beings who have attained the six extrasensory powers, and who, emanating by means of those six extrasensory powers, proceed from buddhafield to buddhafield, wherever the lifespan of beings is limitless. {

source: །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མངོན་པར་ཤེས་པ་དྲུག་ཐོབ་པ་དག །འཇིག་རྟེན་གྱི་ཁམས་གང་ན་སངས་རྒྱས་ཀྱི་སྒྲ་མི་གྲག་པ་དང་། ཆོས་ཀྱི་སྒྲ་མི་གྲག་པ་དང་། དགེ་འདུན་གྱི་སྒྲ་མི་གྲག་པ་དེ་ལྟ་བུའི་འཇིག་རྟེན་གྱི་ཁམས་ནས།
en: Dt.64} “Śāradvatīputra, there are also bodhisattva great beings who have attained the six extrasensory powers, and who proceed from world system to world system, where not even the word Buddha is heard, where not even the word Dharma is heard, and where not even the word Saṅgha is heard.

source: འཇིག་རྟེན་གྱི་ཁམས་སུ་འདོང་ཞིང་སངས་རྒྱས་ཀྱི་ལེགས་པ་བརྗོད། ཆོས་ཀྱི་ལེགས་པ་བརྗོད། དགེ་འདུན་གྱི་ལེགས་པ་བརྗོད་ཅིང་།
en: They speak of the excellence of the Buddha, they speak of the excellence of the Dharma, and they speak of the excellence of the Saṅgha.

source: སེམས་ཅན་དེ་དག་ཀྱང་། སངས་རྒྱས་ཀྱི་སྒྲ་དང་། ཆོས་ཀྱི་སྒྲ་དང་། དགེ་འདུན་ཀྱི་སྒྲ་དེས་སེམས་དང་བར་གྱུར་ཏེ།
en: The minds of those beings are then illuminated by the sound of the word Buddha, the sound of the word Dharma, and the sound of the word Saṅgha.

source: གང་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་བཞུགས་པ་དེ་དག་ཏུ་སྐྱེ་བར་འགྱུར་བར་བྱེད་པ་དག་ཀྱང་ཡོད་དོ། །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དང་པོ་སེམས་བསྐྱེད་ཕྱིན་ཆད། བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔ་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་དང་། ཡང་དག་པར་སྤོང་བ་བཞི་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་།
en: They too will be reborn wherever the lord buddhas reside and are alive at present. “

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དག་ཀྱང་ཐོབ་ནས།
en: Śāradvatīputra, there are also great bodhisattva beings who, following the time when they first begin to set their mind on enlightenment, have indeed attained the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, the five extrasensory powers, the four applications of mindfulness, the four correct exertions, the four supports for miraculous ability, the five faculties, the five powers, the seven branches of enlightenment, the noble eightfold path, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas.

source: དེ་དག་ནམ་ཡང་འདོད་པའི་ཁམས་སུ་ཡང་མི་སྐྱེ། གཟུགས་ཀྱི་ཁམས་དང་། གཟུགས་མེད་པའི་ཁམས་སུ་ཡང་མི་སྐྱེ་ཞིང་། དེ་དག་ཏུ་ཡང་སེམས་ཅན་རྣམས་ཀྱི་དོན་བྱེད་པ་ཡོད་དོ།
en: They are never reborn [involuntarily] in the realm of desire, {Dt.65–66} nor are they reborn [involuntarily] in the realm of form or the realm of formlessness, and yet they do work for the benefit of beings in those realms. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པ་དག །དང་པོ་སེམས་བསྐྱེད་པ་ཉིད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་ཞུགས་ནས། ཕྱིར་མི་ལྡོག་པའི་ས་འཐོབ་པ་ཡང་ཡོད་དོ།
en: Śāradvatīputra, there are also bodhisattva great beings who practice the six perfections, and who, through first setting their mind on enlightenment, enter a bodhisattva’s full maturity and even attain the level at which progress has become irreversible. {

source: །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དང་པོ་སེམས་བསྐྱེད་པ་ཉིད་ཀྱིས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་འཚང་རྒྱ་ཞིང་། མངོན་པར་སངས་རྒྱས་ནས་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་ཏེ།
en: Dt.67} “Śāradvatīputra, there are also bodhisattva great beings who, through their initial setting of the mind on enlightenment, attain manifest buddhahood in unsurpassed, complete enlightenment, and who, having attained manifest buddhahood, turn the wheel of the Dharma.

source: སེམས་ཅན་ཚད་མེད་གྲངས་མེད་པའི་དོན་བྱས་ནས། ཕུང་པོ་མ་ལུས་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་ཞིང་། དེ་དག་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་ཀྱང་དམ་པའི་ཆོས་བསྐལ་པ་འམ། བསྐལ་པ་བས་ལྷག་པར་གནས་པ་དག་ཀྱང་ཡོད་དོ།
en: Acting for the benefit of countless and limitless beings, they attain final nirvāṇa in the expanse of nirvāṇa where no residue of the aggregates is left behind; and, even after passing into final nirvāṇa, their Dharma will remain for an eon, or for more than an eon. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དང་པོ་སེམས་བསྐྱེད་པ་ཉིད་ཀྱིས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་རྣལ་འབྱོར་ལ་སྙོམས་པར་འཇུག་ཅིང་། དེ་དག་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་དང་ལྷན་ཅིག །སངས་རྒྱས་ཀྱི་ཞིང་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དུ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་བལྟ་བ་དང་།
en: Śāradvatīputra, there are also bodhisattva great beings who, through their initial setting of the mind on enlightenment, are absorbed in union with the perfection of wisdom, and who, accompanied by a hundred billion trillion bodhisattvas, also move from buddhafield to buddhafield in order to behold the lord buddhas, bring beings to maturation, and refine the buddhafields. “

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱ་བའི་དོན་དུ་འདོང་བ་དག་ཀྱང་ཡོད་དོ། །ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ། བསམ་གཏན་བཞི་ཐོབ་པ་ཚད་མེད་པ་བཞི་དང་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་ཐོབ་པ་དག །
en: Śāradvatīputra, there are also bodhisattva great beings who practice the perfection of wisdom, who have attained the four meditative concentrations, and attained the four immeasurable attitudes and the four formless absorptions.

source: བསམ་གཏན་དང་ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དེ་དག་གིས་ཚུལ་དུ་མར་རྣམ་པར་རྩེ་ཞིང་།
en: Through these meditative concentrations, immeasurable attitudes, and formless absorptions, they emanate in manifold ways.

source: འདི་ལྟ་སྟེ། བསམ་གཏན་དང་པོ་ལ་སྙོམས་པར་འཇུག་གོ །དེ་དག་བསམ་གཏན་དང་པོ་དེ་ལས་ལངས་ནས། འགོག་པའི་སྙོམས་པར་འཇུག་པ་ལ་མཉམ་པར་གཞོག་གོ །
en: That is to say, they become absorbed in the first meditative concentration, and having arisen from that first meditative concentration, they become absorbed in the absorption of cessation.

source: འགོག་པའི་སྙོམས་པར་འཇུག་པ་ལས་ལངས་ནས། བསམ་གཏན་གཉིས་པ་ལ་སྙོམས་པར་འཇུག་གོ །བསམ་གཏན་གཉིས་པ་ལས་ལངས་ནས།
en: Having arisen from the absorption of cessation, they become absorbed in the second meditative concentration; and, having arisen from the second meditative concentration, they become absorbed in the absorption of cessation.

source: འགོག་པའི་སྙོམས་པར་འཇུག་པ་ལ་མཉམ་པར་གཞོག་གོ །དེ་ལས་ལངས་ནས་བསམ་གཏན་གསུམ་པ་ལ་སྙོམས་པར་འཇུག་གོ །
en: Having arisen therefrom, they become absorbed in the third meditative concentration; and, having arisen therefrom, they become absorbed in the absorption of cessation.

source: དེ་ལས་ལངས་ནས་འགོག་པའི་སྙོམས་པར་འཇུག་པ་ལ་མཉམ་པར་གཞོག་གོ །དེ་ལས་ལངས་ནས་བསམ་གཏན་བཞི་པ་ལ་སྙོམས་པར་འཇུག་གོ །དེ་ལས་ལངས་ནས་འགོག་པའི་སྙོམས་པར་འཇུག་པ་ལ་མཉམ་པར་གཞོག་གོ །
en: Having arisen therefrom, they become absorbed in the fourth meditative concentration; and, having arisen therefrom, they become absorbed in the absorption of cessation.

source: དེ་ལས་ལངས་ནས་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལ་ཡང་སྙོམས་པར་འཇུག་གོ །དེ་ལས་ལངས་ནས་འགོག་པའི་སྙོམས་པར་འཇུག་པ་ལ་མཉམ་པར་གཞོག་གོ །
en: Having arisen therefrom, they become absorbed in the sphere of infinite space; and, having arisen therefrom, they become absorbed in the absorption of cessation.
